{"basics":{"name":"Nikita Panteleev","label":"Team leader: developing web solutions for startups","picture":"https://scontent.ffjr1-3.fna.fbcdn.net/v/t1.0-9/24910119_2163878306959573_1670301011758238004_n.jpg?_nc_fx=ffjr1-2&oh=5ce9ef97f9e83931617931454bbdf4ba&oe=5AF25503","email":"nikita.panteleev@phystech.edu","phone":"+971 0502082077","website":"https://nikitapanteleev.github.io/","summary":"I like functional programming and computer science in general. I have experience in backend development in banking, tourism, gambling,  e-commerce and logistics. I'm really excited about Scala/Akka stack, but I also like functional programming with Java 8 and Spring framework. The choice of programming language is not important for me, although I strongly prefer typed languages.  Now I'm switching my career to product management and leadership. I'm a team leader of distributed group of developers. I organize the process,  plan sprints, transform business needs into technical requirements, choose technology, actively develop code in initial stages, pay  extra attention to code review and integration testing, configure infrastructure and pipelines. My main language is Scala and I have  experience with Java, Python, C#, Javascript/Typescript. I have basic understanding of machine learning techniques and NLP. And I still  remember some algorithms. I prefer real-world product development with real customers. I studied physics at university (Bachelor Degree)  which gave me solid math background and model thinking.\n","location":{"address":"Silicon Oasis","city":"Dubai","countryCode":"UAE"},"profiles":[{"network":"LinkedIn","username":"Nikita Panteleev","url":"https://www.linkedin.com/in/nikita-panteleev-45607973/"},{"network":"","username":"CV.pdf","url":"/assets/Nikita Panteleev (Team Lead, Scala, Java) CV.pdf"}]},"work":[{"company":"Logistics start up","position":"CTO","website":"","startDate":"2017-06-20","endDate":"","summary":"I joined logistics startup at early stage. I introduced agile practices for distributed team of developers  (jira, scrum sprints, code review on gitlab), wrote docker builds for java, javascript, php and android builds. Configured gitlab pipelines  with DCOS (docker orchestration). Configured network rules (cloudflare, marathon, nginx) and deployment without downtime. Added  testing environments. Improved java code by introducing java 8 collections, scala-like collection (jOOL), lombok. I added spring security, spring jpa + hibernate optimization, QueryDsl and REST data. For frontend I introduced typescript and ionic development. Although these 6 months were intensive  from development and management perspective, the business side was way behind the tech.\n","highlights":["Technology improvement","Product delivery in time"]},{"company":"noon.com","position":"Scala Developer","website":"https://www.noon.com","startDate":"2016-12-25","endDate":"2017-05-20","summary":"Delivering business features in fast-growing e-commerce startup, managing remote contractors, supporting existing infrastructure. Languages include Scala, Java, NodeJs. Frameworks include akka, play, scalaTest, kafka (with reactive streams +  avro/protobuf serialization), cassandra, camel, slick + postgres. Devops practices learnt include microservices, Docker,  mesos/DCOS, gitlab pipelines, metrics (prometheus/grafana). The entire development team was fired and replaced by cheaper remote team for business/political reasons.\n","highlights":["Development of few microservices for consumer platform","Performance metrics introduction","Integration, fixes, optimization in several services in consumer platform and supply chain"]},{"company":"Evolution Gaming","position":"Scala Developer","website":"https://www.evolutiongaming.com/","startDate":"2015-12-20","endDate":"2016-12-20","summary":"Maintaining and delivering new features to the most profitable product of the live casino provider. Main duty was support for production. This implies that 30% of work time is wasted on log grepping and linking/duplicating  tickets together. The interesting part of work was migration from Java-like stack to the Event driven model and Akka persistence,  Akka-cluster. Left company because looked for challenge and wanted to get more experience. After all, gambling business focuses  more on stability than on innovation.\n","highlights":["Support and maintenance of most profitable game in the company","Migration from Java Spring stack to Akka persistence & CQRS"]},{"company":"Toprater","position":"Scala Proselyte","website":"http://toprater.com/","startDate":"2014-07-01","endDate":"2015-12-00","summary":"I joined this company because startup offers innovative natural language framework (sentimental analysis based on word2vec approach). I  started from web crawling tasks using python, then managing freelancers and then switched to data processing or ETL. I mastered my skills in postgres data cleaning and then switched to Apache spark (1.1.0). Using Scala I developed ETL pipelines framework. I played with many tools like scalaZ, DSL combinators, Futures api. This gave me solit background for my next Scala job. Left company because simple didn't receive  salary for 3 months.\n","highlights":["Developing ETL framework"]},{"company":"Logrocon","position":"Software Developer","website":"https://www.evolutiongaming.com/","startDate":"2013-10-15","endDate":"2014-07-01","summary":"Auto-testing of banking systems and development of MVPs.\n","highlights":["configured and maintained Quality Assurance system, developed framework and tests for web-application","Android prototype for truck drivers","Windows mobile prototype for truck drivers","Node webkit application for tickets booking"]}],"volunteer":[{"organization":"School 1329","position":"Informatics Teacher","website":"","startDate":"2010-01-01","endDate":"2012-01-01","summary":"Teaching children of basics of programming and algorithms."}],"education":[{"institution":"Moscow Institute of Physics and Technology","area":"Applied Math and Physics","studyType":"Bachelor","startDate":"2008-06-01","endDate":"2013-06-01","gpa":"4.4"}],"skills":[{"name":"Scala","level":"Master","keywords":["Akka","Akka persistence","Akka cluster","Scalaz","Apache Spark"]},{"name":"Java","level":"Master","keywords":["Spring","Hibernate","Java Collections"]},{"name":"Devops","level":"Master","keywords":["Docker","DCOS","nginx","marathon"]},{"name":"Web development","level":"Intermediate","keywords":["Typescript","Javascript","Ionic"]}],"languages":[{"language":"English","fluency":"Native speaker"},{"language":"Russian","fluency":"Native speaker"}],"interests":[{"name":"Sports","keywords":["Football","Kite Surfing"]},{"name":"Board games","keywords":["Chess","Japanese mahjong"]}],"references":[{"name":"Erlich Bachman","reference":"It is my pleasure to recommend Richard, his performance working as a consultant for Main St. Company proved that he will be a valuable addition to any company.\n"}]}
